13/data/attachments/4a5c685bcbe8ec54.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_31db1df5-4841-4318-a456-3dc6d7d1c19a</nif:username>
            <nif:friendToBeAdded>Michelle_there_Friend_1518_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>